[
  {
    "paraList": [
      {
        "paragraph": "Team DAVE is FRC Team 3683 – the FIRST Robotics Team at St. David CSS in Waterloo, Ontario, Canada.",
        "order": 0
      },
      {
        "paragraph": "The 2025 year is the 15th season of Team DAVE. This season, we competed at the Niagara Event, the University of Waterloo Event, winning both events. At the FIRST Ontario Provincial Championship, we won our field and became Provincial Finalists.",
        "order": 1
      },
      {
        "paragraph": "DAVE seeks to teach students the core principles of STEAM, while giving them the opportunity to travel and compete across the world. DAVE also helps students develop their academic potential while interacting with the local community.",
        "order": 2
      },
      {
        "paragraph": "DAVE understands that most people have never built a robot before, therefore we welcome students from grades 8-12 and all levels of experience with open arms.",
        "order": 3
      },
      {
        "paragraph": "You can find more materials about Team DAVE under the Support tab, or you can click here!",
        "order": 4
      },
      {
        "paragraph": "",
        "order": 5
      }
    ]
  },
  {
    "postList": [
      {
        "post": "Wow, the FIRST Ontario Provincial Championship was an amazing way to finish off one of DAVE’s strongest seasons! At our final event of the season, DAVE competed against the top 100 teams in Ontario for the chance of winning the title of Provincial Champion. On the first day, DAVE played in six qualification matches on … Continue reading 2025 Ontario Provincial Championship"
      },
      {
        "post": "Wow, Team DAVE was overjoyed to compete in our hometown at the University of Waterloo District Event! DAVE played alongside other WWFIRST teams, fighting for the chance to take home a second blue banner for the season. DAVE was the first team to arrive at the venue on Friday morning, allowing us to secure the … Continue reading 2025 University of Waterloo District Event"
      },
      {
        "post": "Team DAVE was thrilled to compete at the inaugural Niagara College District Event this past weekend. From March 8th to 9th, DAVE went up against many of the top teams in the world, fighting for the chance to become winners of the event. DAVE started the day bright and early, arriving at the venue at … Continue reading 2025 Niagara College Event"
      },
      {
        "post": "Team DAVE was thrilled to compete at the first annual All-Star Alliance Invitational from August 9th – 11th at Kettering University in Flint, Michigan. We partnered with 118 Robonauts and 2468 Team Appreciate to form the “Texas, Eh?” alliance, going up against eight other alliances for the chance to become the first alliance to win … Continue reading 2024 All-Star Alliance Invitational"
      }
    ]
  },
  {
    "imageList": [
      {
        "url": "https://www.teamdave.ca/wp-content/uploads/2025/07/cropped-logo.png",
        "description": "cropped logo",
        "widthAndHeight": [
          864,
          362
        ]
      },
      {
        "url": "https://www.teamdave.ca/wp-content/uploads/2025/03/happy-won-niagara-ty-op-2025.png",
        "description": "happy won niagara ty op 2025",
        "widthAndHeight": [
          1472,
          833
        ]
      },
      {
        "url": "https://www.teamdave.ca/wp-content/uploads/2024/02/FRCLogo2024.png",
        "description": "FRCLogo2024",
        "widthAndHeight": [
          222,
          140
        ]
      }
    ]
  }
]